/**
 * ************************************************************************
 * @file menu.h
 * @author Thybing (yanbinghao86@gmail.com)
 * @brief 菜单对象
 * @details  采用单例模式，请在使用前进行初始化
 * @version 1.0.0
 * @date 2024-8-14
 * ************************************************************************
 */
#ifndef _MENU_NEST_MENU_H_
#define _MENU_NEST_MENU_H_
#include "menu_nest/page.h"

/**
 * ************************************************************************
 * @brief 初始化菜单对象
 * 
 * @param[in] p_main_page 菜单主页
 * ************************************************************************
 */
void MN_menu_init(MN_page * p_main_page);

/**
 * ************************************************************************
 * @brief 获取菜单的Main页面指针
 * 
 * @return 菜单的Main页面指针
 * ************************************************************************
 */
MN_page * MN_get_main_page();

/**
 * ************************************************************************
 * @brief 获取菜单的当前页面指针
 * 
 * @return 菜单的当前页面指针
 * ************************************************************************
 */
MN_page * MN_get_cur_page();

/**
 * ************************************************************************
 * @brief 跳转至目标页面
 * 
 * @param[in] p_target_page  要跳转的目标页面指针
 * 
 * @details 在跳转时会调用目标页面的on_forward回调函数
 * ************************************************************************
 */
void MN_menu_page_forward(MN_page * const p_target_page);

/**
 * ************************************************************************
 * @brief 通过页面标题跳转至目标页面
 * 
 * @param[in] title  要跳转的目标页面的标题
 * 
 * @details 在跳转时会调用目标页面的on_forward回调函数
 * ************************************************************************
 */
void MN_menu_page_title_forward(const char * const title);

/**
 * ************************************************************************
 * @brief 回退历史页面
 * 
 * @details 会调用当前页面的on_retreat回调函数，然后调用回退后的页面的on_retreat_from_other_page回调函数
 * ************************************************************************
 */
void MN_menu_page_retreat();

/**
 * ************************************************************************
 * @brief 显示/渲染菜单当前页面
 * 
 * ************************************************************************
 */
void MN_menu_rendering();

/**
 * ************************************************************************
 * @brief 获取菜单的交互模块 
 * 
 * @return 菜单的交互模块，可以用于设置交互回调函数及其中的内存
 * ************************************************************************
 */
MN_interaction * MN_menu_get_interaction();

/**
 * ************************************************************************
 * @brief 向菜单的输入队列中添加消息
 * 
 * @param[in] input  菜单输入
 * ************************************************************************
 */
void MN_menu_input(const input_t input);

/**
 * ************************************************************************
 * @brief 处理输入队列中的消息
 * 
 * @details 将队列中的消息取出，依次输入到当前item，当前页面，menu的输入模块中。如果在某个输入模块被捕获，则不会输入到后面的输入模块
 * ************************************************************************
 */
void MN_menu_handle_input_queue();

#endif //_MENU_NEST_MENU_H_
