/**
 * ************************************************************************
 * @file menu.h
 * @author Thybing (yanbinghao86@gmail.com)
 * @brief 菜单对象
 * @details  采用静态变量的懒汉单例模式
 * @version 1.0.0
 * @date 2024-8-14
 * ************************************************************************
 */
#ifndef _MENU_NEST_MENU_H_
#define _MENU_NEST_MENU_H_
#include "menu_nest/page.h"

//前向声明
typedef struct MN_menu MN_menu;

/**
 * ************************************************************************
 * @brief 获取菜单的Main页面指针
 * 
 * @return 菜单的Main页面指针
 * ************************************************************************
 */
MN_page * MN_get_main_page();

/**
 * ************************************************************************
 * @brief 跳转至目标页面
 * 
 * @param[in] p_target_page  要跳转的目标页面指针
 * 
 * ************************************************************************
 */
void MN_menu_page_forward(MN_page * const p_target_page);

/**
 * ************************************************************************
 * @brief 回退历史页面
 * 
 * ************************************************************************
 */
void MN_menu_page_retreat();

/**
 * ************************************************************************
 * @brief 为菜单设置交互回调函数
 * 
 * @param[in] callback  交互回调函数
 * 
 * ************************************************************************
 */
void MN_menu_set_handle_callback(const handle_callback_t callback);

#endif //_MENU_NEST_MENU_H_
